In [1]:
from pyspark.sql import SparkSession, Row

spark = SparkSession.builder.appName("RowExample").getOrCreate()

your 131072x1 screen size is bogus. expect trouble
25/08/20 07:45:06 WARN Utils: Your hostname, KLZPC0015 resolves to a loopback address: 127.0.1.1; using 172.25.17.96 instead (on interface eth0)
25/08/20 07:45:06 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/08/20 07:45:09 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
data = [
    (1, "Manta", 75000, "IT", 24),
    (2, "Dipankar", 30000, "Post Master", 27),
    (3, "Souvik", 60000, "Army Officer", 27),
    (4, "Soukarjya", 45000, "BDO", 26),
    (5, "Arvind", 35000, "Business Data Analyst", 28),
    (6, "Prodipta", 25000, "Data Analyst", 28),
    (7, "Padma", 20000, "Data Analyst", 27),
    (8, "Panta", 125000, "Business Analyst", 27),
    (9, "Panta", 125000, "Business Analyst", 27)
]

In [3]:
df = spark.createDataFrame(data, ["id", "name", "salary", "department", "age"])
df.show()

+---+---------+------+--------------------+---+
| id|     name|salary|          department|age|
+---+---------+------+--------------------+---+
|  1|    Manta| 75000|                  IT| 24|
|  2| Dipankar| 30000|         Post Master| 27|
|  3|   Souvik| 60000|        Army Officer| 27|
|  4|Soukarjya| 45000|                 BDO| 26|
|  5|   Arvind| 35000|Business Data Ana...| 28|
|  6| Prodipta| 25000|        Data Analyst| 28|
|  7|    Padma| 20000|        Data Analyst| 27|
|  8|    Panta|125000|    Business Analyst| 27|
|  9|    Panta|125000|    Business Analyst| 27|
+---+---------+------+--------------------+---+

In [4]:
print("Dropping the 'age' column: ")
df_dropped = df.drop("age")
df_dropped.show()

Dropping the 'age' column:

+---+---------+------+--------------------+
| id|     name|salary|          department|
+---+---------+------+--------------------+
|  1|    Manta| 75000|                  IT|
|  2| Dipankar| 30000|         Post Master|
|  3|   Souvik| 60000|        Army Officer|
|  4|Soukarjya| 45000|                 BDO|
|  5|   Arvind| 35000|Business Data Ana...|
|  6| Prodipta| 25000|        Data Analyst|
|  7|    Padma| 20000|        Data Analyst|
|  8|    Panta|125000|    Business Analyst|
|  9|    Panta|125000|    Business Analyst|
+---+---------+------+--------------------+

In [5]:
print("Dropping 'id' and 'department' columns: ")
df_multiple_dropped = df.drop("id", "department")
df_multiple_dropped.show()

Dropping 'id' and 'department' columns:

+---------+------+---+
|     name|salary|age|
+---------+------+---+
|    Manta| 75000| 24|
| Dipankar| 30000| 27|
|   Souvik| 60000| 27|
|Soukarjya| 45000| 26|
|   Arvind| 35000| 28|
| Prodipta| 25000| 28|
|    Padma| 20000| 27|
|    Panta|125000| 27|
|    Panta|125000| 27|
+---------+------+---+

In [6]:
print("Dropping a column that does not exist ('gender'): ")
df_non_existent = df.drop("gender")
df_non_existent.show()

Dropping a column that does not exist ('gender'):

+---+---------+------+--------------------+---+
| id|     name|salary|          department|age|
+---+---------+------+--------------------+---+
|  1|    Manta| 75000|                  IT| 24|
|  2| Dipankar| 30000|         Post Master| 27|
|  3|   Souvik| 60000|        Army Officer| 27|
|  4|Soukarjya| 45000|                 BDO| 26|
|  5|   Arvind| 35000|Business Data Ana...| 28|
|  6| Prodipta| 25000|        Data Analyst| 28|
|  7|    Padma| 20000|        Data Analyst| 27|
|  8|    Panta|125000|    Business Analyst| 27|
|  9|    Panta|125000|    Business Analyst| 27|
+---+---------+------+--------------------+---+